<template>
  <div class="container">
    <h1 class="text-48">首頁 index</h1>
    <ul class="text-center">
      <li>這是測試的內容第1行</li>
      <li>這是測試的內容第2行</li>
      <li>這是測試的內容第3行</li>
      <li>這是測試的內容第4行</li>
      <li>這是測試的內容第5行</li>
      <li>這是測試的內容第6行</li>
      <li>這是測試的內容第7行</li>
      <li>這是測試的內容第8行</li>
      <li>這是測試的內容第9行</li>
      <li>這是測試的內容第10行</li>
      <li>這是測試的內容第11行</li>
      <li>這是測試的內容第12行</li>
      <li>這是測試的內容第13行</li>
      <li>這是測試的內容第14行</li>
      <li>這是測試的內容第15行</li>
      <li>這是測試的內容第16行</li>
      <li>這是測試的內容第17行</li>
      <li>這是測試的內容第18行</li>
      <li>這是測試的內容第19行</li>
      <li>這是測試的內容第20行</li>
      <li>這是測試的內容第21行</li>
      <li>這是測試的內容第22行</li>
      <li>這是測試的內容第23行</li>
      <li>這是測試的內容第24行</li>
      <li>這是測試的內容第25行</li>
      <li>這是測試的內容第26行</li>
      <li>這是測試的內容第27行</li>
      <li>這是測試的內容第28行</li>
      <li>這是測試的內容第29行</li>
      <li>這是測試的內容第30行</li>
      <li>這是測試的內容第31行</li>
      <li>這是測試的內容第32行</li>
      <li>這是測試的內容第33行</li>
      <li>這是測試的內容第34行</li>
      <li>這是測試的內容第35行</li>
      <li>這是測試的內容第36行</li>
      <li>這是測試的內容第37行</li>
      <li>這是測試的內容第38行</li>
      <li>這是測試的內容第39行</li>
      <li>這是測試的內容第40行</li>
      <li>這是測試的內容第41行</li>
      <li>這是測試的內容第42行</li>
      <li>這是測試的內容第43行</li>
      <li>這是測試的內容第44行</li>
      <li>這是測試的內容第45行</li>
      <li>這是測試的內容第46行</li>
      <li>這是測試的內容第47行</li>
      <li>這是測試的內容第48行</li>
      <li>這是測試的內容第49行</li>
      <li>這是測試的內容第50行</li>
      <li>這是測試的內容第51行</li>
      <li>這是測試的內容第52行</li>
      <li>這是測試的內容第53行</li>
      <li>這是測試的內容第54行</li>
      <li>這是測試的內容第55行</li>
      <li>這是測試的內容第56行</li>
      <li>這是測試的內容第57行</li>
      <li>這是測試的內容第58行</li>
      <li>這是測試的內容第59行</li>
      <li>這是測試的內容第60行</li>
      <li>這是測試的內容第61行</li>
      <li>這是測試的內容第62行</li>
      <li>這是測試的內容第63行</li>
      <li>這是測試的內容第64行</li>
      <li>這是測試的內容第65行</li>
      <li>這是測試的內容第66行</li>
      <li>這是測試的內容第67行</li>
      <li>這是測試的內容第68行</li>
      <li>這是測試的內容第69行</li>
      <li>這是測試的內容第70行</li>
      <li>這是測試的內容第71行</li>
      <li>這是測試的內容第72行</li>
      <li>這是測試的內容第73行</li>
      <li>這是測試的內容第74行</li>
      <li>這是測試的內容第75行</li>
      <li>這是測試的內容第76行</li>
      <li>這是測試的內容第77行</li>
      <li>這是測試的內容第78行</li>
      <li>這是測試的內容第79行</li>
      <li>這是測試的內容第80行</li>
      <li>這是測試的內容第81行</li>
      <li>這是測試的內容第82行</li>
      <li>這是測試的內容第83行</li>
      <li>這是測試的內容第84行</li>
      <li>這是測試的內容第85行</li>
      <li>這是測試的內容第86行</li>
      <li>這是測試的內容第87行</li>
      <li>這是測試的內容第88行</li>
      <li>這是測試的內容第89行</li>
      <li>這是測試的內容第90行</li>
      <li>這是測試的內容第91行</li>
      <li>這是測試的內容第92行</li>
      <li>這是測試的內容第93行</li>
      <li>這是測試的內容第94行</li>
      <li>這是測試的內容第95行</li>
      <li>這是測試的內容第96行</li>
      <li>這是測試的內容第97行</li>
      <li>這是測試的內容第98行</li>
      <li>這是測試的內容第99行</li>
      <li>這是測試的內容第100行</li>
    </ul>
  </div>
</template>

<script setup>
import { onMounted } from "vue";
import { initFlowbite } from "flowbite";

// initialize components based on data attribute selectors
onMounted(() => {
  initFlowbite();
});

</script>
